[
    {
        "name": "Dominic Verity",
        "affiliation": "Macquarie University and Australian National University",
        "title" : "Themes and motivations in \\(\\infty\\)-cosmology",
        "abstract": "<p>In this talk, we review the current state of the art in <i>model agnostic</i> \\(\\infty\\)-category theory, which seeks to provide a unified account of \\(\\infty\\)-category theory freed from the straight jacket of a specific model.</p><p>In particular, we shall focus on the theory of <i>\\(\\infty\\)-cosmoi</i>, a general framework for the development of <i>fibrational \\(\\infty\\)-category theories</i>. The key novelty of this approach is that it allows both for the model independent, <i>synthetic</i> development of \\(\\infty\\)-categorical results and for the transport of <i>analytically</i> derived such results from one model to another.</p><p>This talk, however, is not intended to provide a thorough going mathematical introduction to \\(\\infty\\)-cosmology, largely because Emily Riehl and I have written a long and detailed graduate text <a href='https://elements-book.github.io'>Elements of \\(\\infty\\)-Category Theory</a> for that purpose. Instead, I would like to dwell on some underlying <i>\"philosophical\"</i> themes and motivations that have shaped the development of \\(\\infty\\)-cosmology. Some of these, including the key application of traditional, Australian-style <i>2-category theory</i>, started as experiments in the application of somewhat unlikely, low dimensional, methods to the expression of the category theory of \\(\\infty\\)-categories. Indeed, to our own great surprise, these have proved to be <i>unreasonably effective</i> tools which now form the cornerstone of the development discussed in The Elements.</p><p>My hope is to encourage symposium participants to embrace experimentation with unlikely ideas during their time at MATRIX. In many cases, of course, these will remain only mirages of useful mathematics, but in an important minority they will lead to powerful new insights and inspirations.</p>",
        "invited": true,
        "day": 19,
        "start": "1899-12-30T09:31:36.000Z",
        "end": "1899-12-30T10:31:36.000Z",
        "startlong": "September 19, 2022 08:30 GMT+10",
        "endlong": "September 19, 2022 09:30 GMT+10",
        "start_ISO8601": "2022-09-18T22:30:00.000Z",
        "end_ISO8601": "2022-09-18T23:30:00.000Z"
    },
    {
        "name": "Chandan Singh",
        "affiliation": "University of Melbourne",
        "title": "Categorical Structures to Virtual Tangles",
        "abstract": "<p>A classic result of Turaev says that tangles on ribbons can be described as the free ribbon monoidal category generated by one object. This tells that the category of tangles on ribbon is universal in the sense that it is free on tortile Yang-Baxtor operator. Virtual Tangles are a higher dimensional version of tangles. Recently, Brochier showed that virtual tangles have universal properties similar to classical tangles. Virtual tangles also have a \"knot theoretic\" description in terms of circuit algebras. In this talk, we show that one can see virtual tangles as wheeled props, which is rigid props or equivalently, a type of strict rigid symmetric monoidal category generated by a single object.</p>",
        "invited": false,
        "day": "19",
        "start": "1899-12-30T11:01:36.000Z",
        "end": "1899-12-30T11:31:36.000Z",
        "startlong": "September 19, 2022 10:00 GMT+10",
        "endlong": "September 19, 2022 10:30 GMT+10",
        "start_ISO8601": "2022-09-19T00:00:00.000Z",
        "end_ISO8601": "2022-09-19T00:30:00.000Z"
    },
    {
        "name": "Olivia Borghi",
        "affiliation": "University of Melbourne",
        "title": "G-Monoidal Infinity Categories",
        "abstract": "<p>\nA monoidal category is an algebraic object in the category of categories, in the sense that it is a category equipped with an associative product.  We may ask to what extent this monoidal product is commutative.  A G-monoidal category is a monoidal where the monoidal product's commutativity is government by an action of some permutation group G.  In this talk I will explain a definitiona for G-monoidal  1-categories as well as a definition for G-monoidal infinity categories.  Hopefully supplying necessary visual intuition for such objects along the way.\n</p>",
        "invited": false,
        "day": "19",
        "start": "1899-12-30T11:31:36.000Z",
        "end": "1899-12-30T12:01:36.000Z",
        "startlong": "September 19, 2022 10:30 GMT+10",
        "endlong": "September 19, 2022 11:00 GMT+10",
        "start_ISO8601": "2022-09-19T00:30:00.000Z",
        "end_ISO8601": "2022-09-19T01:00:00.000Z"
    },
    {
        "name": "Marco Volpe",
        "affiliation": "University of Regensburg",
        "title": "Six operations in topology",
        "abstract": "<p>In topology, the six functor formalism consists of a collection of functorial operations defined on derived categories of sheaves of abelian groups. Through these functors and their relations one may recover the main features of singular cohomology, including Poincaré duality. In this talk we will explain which categorical properties of the \\(\\infty\\)-category  of sheaves of spectra on a locally compact Hausdorff space allow one to construct such formalism in the more general setting of sheaves of stable and bicomplete \\(\\infty\\)-categories.</p>",
        "invited": false,
        "day": "19",
        "start": "1899-12-30T21:01:36.000Z",
        "end": "1899-12-30T21:31:36.000Z",
        "startlong": "September 19, 2022 20:00 GMT+10",
        "endlong": "September 19, 2022 20:30 GMT+10",
        "start_ISO8601": "2022-09-19T10:00:00.000Z",
        "end_ISO8601": "2022-09-19T10:30:00.000Z"
    },
    {
        "name": "Moreau Vincent",
        "affiliation": "IRIF",
        "title": "From profinite words to profinite λ-terms",
        "abstract": "<p>\nThis is joint work with Paul-André Melliès and Sam van Gool.\n</p>\n<p>\nThe aim of this talk is to combine profinite methods used in automata theory and models of the λ-calculus to obtain a notion of profinite λ-term. Profinite words provide a way to speak about limiting behavior of finite words with respect to deterministic automata. In order to connect this notion of profiniteness to the λ-calculus, we consider higher-order automata which can process arbitrary simply-typed λ-terms as their input. Existing notions of automata on words and trees are then obtained as special cases.\n</p>\n<p>\nOur main contribution is the study of the notion of parametric λ-term in the sense of Reynolds. We establish a link with profinite words in the double cartesian closed category of finite sets, functions and relations, which corresponds to deterministic automata. We prove that in this setting, the notion of parametric λ-term essentially coincides with the classical notion of profinite word.\n</p>",
        "invited": false,
        "day": "19",
        "start": "1899-12-30T21:31:36.000Z",
        "end": "1899-12-30T22:01:36.000Z",
        "startlong": "September 19, 2022 20:30 GMT+10",
        "endlong": "September 19, 2022 21:00 GMT+10",
        "start_ISO8601": "2022-09-19T10:30:00.000Z",
        "end_ISO8601": "2022-09-19T11:00:00.000Z"
    },
    {
        "name": "Luuk Stehouwer",
        "affiliation": "Max Planck Institute for Mathematics",
        "title": "Two-dimensional equivariant topological field theories",
        "abstract": "<p>\nThe classification of two-dimensional topological field theories (TFTs) requires an understanding of dualizable objects in symmetric monoidal bicategories. Many interesting generalizations of this basic case require the notion of homotopy fixed point with respect to 2-group actions. I provide definitions and explicit examples by drawing parallels with fixed points of actions of 1-groups on 1-categories.\n</p>",
        "invited": false,
        "day": "19",
        "start": "1899-12-30T22:31:36.000Z",
        "end": "1899-12-30T23:01:36.000Z",
        "startlong": "September 19, 2022 21:30 GMT+10",
        "endlong": "September 19, 2022 22:00 GMT+10",
        "start_ISO8601": "2022-09-19T11:30:00.000Z",
        "end_ISO8601": "2022-09-19T12:00:00.000Z"
    },
    {
        "name": "Magnus Hellstrøm-Finnsen",
        "affiliation": "Østfold University College ",
        "title": "Hochschild Cohomology of Monads",
        "abstract": "<p>\nIn this talk I report on some work in progress on Hochschild cohomology of monads. We discuss some basic combinatorial observations of the Hochschild cochain complex and how a monad fit somewhat naturally into that. Then we define the complex and the cohomology of a monad. If time permits, we interpret the lower dimensional cohomology groups, define the cohomology ring and the cup-product on the cohomology ring. \n</p>",
        "invited": false,
        "day": "19",
        "start": "1899-12-30T23:01:36.000Z",
        "end": "1899-12-30T23:31:36.000Z",
        "startlong": "September 19, 2022 22:00 GMT+10",
        "endlong": "September 19, 2022 22:30 GMT+10",
        "start_ISO8601": "2022-09-19T12:00:00.000Z",
        "end_ISO8601": "2022-09-19T12:30:00.000Z"
    },
    {
        "name": "Arnaud Ngopnang Ngompe",
        "affiliation": "University of Regina",
        "title": "The Hurewicz model structure for non-negatively graded chain complexes",
        "abstract": "<p>\nBy a theorem of Christensen and Hovey, the category of non-negatively chain complexes has a model structure, called the Hurewicz or h-model structure, where the weak equivalences are the chain homotopy equivalences. The properties of that model structure are obtained by  adapting the work of May and Ponto on the h-model structure for unbounded chain complexes. Hence, the Dold-Kan correspondence induces on the category of simplicial modules a new model structure with interesting properties. In our talk, we give a description of the two model categories and their properties.\n</p>",
        "invited": false,
        "day": "20",
        "start": "1899-12-30T09:01:36.000Z",
        "end": "1899-12-30T09:31:36.000Z",
        "startlong": "September 20, 2022 08:00 GMT+10",
        "endlong": "September 20, 2022 08:30 GMT+10",
        "start_ISO8601": "2022-09-19T22:00:00.000Z",
        "end_ISO8601": "2022-09-19T22:30:00.000Z"
    },
    {
        "name": "Patrick Elliot",
        "affiliation": "University of Melbourne",
        "title" : "The nerve and homotopy coherent nerve constructions for cyclic operads",
        "abstract" : "<p>Coloured Cyclic operads are an important and natural generalisation of coloured operads in which operations have no preferred input and output. Examples arise naturally in low dimensional topology and for algebraic structures with pairings. Hackney, Robertson, and Yau recently laid the groundwork for a theory of up-to-homotopy cyclic operads, building on the dendroidal approach to infinity operads of Cisinski, Moerdijk, and Weiss. In this talk we will present work in progress on the homotopy theory of higher cyclic operads in which the colour set is equipped with an involution, including a cyclic dendoridal nerve theorem and the construction of a homotopy coherent cyclic dendroidal nerve.</p>",
        "day": 20,
        "start": "1899-12-30T09:31:36.000Z",
        "end": "1899-12-30T10:01:36.000Z",
        "startlong": "September 20, 2022 08:30 GMT+10",
        "endlong": "September 20, 2022 09:00 GMT+10",
        "start_ISO8601": "2022-09-19T22:30:00.000Z",
        "end_ISO8601": "2022-09-19T23:00:00.000Z"
    },
    {
        "name": "Colin Bloomfield",
        "affiliation": "Vanderbilt University",
        "title": "Categorical Semantics for Non-classical First-order Logics",
        "abstract": "<p>\nWe extend Lawvere-Pitts prop-categories (aka. hyperdoctrines) to develop a general framework for providing algebraic/categorical semantics for non-classical first-order logics. Instead of fixing the interpretation of quantifiers via adjoint conditions, we view quantifiers more generally as variable binding operations and explore what conditions on quantifiers are necessary to still encode the semantics in a nice 2-category, where theories are objects, structures are morphisms, and structure-preserving maps are 2-cells. After providing some examples, we showcase two results for the general prop-categorical semantics. First, we extend the homomorphism theorem from universal algebra, which gives an orthogonal factorization system for the underlying 1-category of the semantics. Then, for non-classical logics with prop-categorical semantics, we provide a novel characterization of the closure of a class of structures under their common first-order theory, which mirrors Birkhoff's characterization of the closure of a class of algebras under their common equational theory. This result is unique to the prop-categorical semantics and does not hold, for example, in the Tarskian semantics of classical first-order logic. The prop-categories we consider are much more general than traditional intuitionistic prop-categories or triposes. Nonetheless, to our knowledge, our results are still new even when restricted to these special classes of prop-categories. This talk is based on joint work with Yoshihiro Maruyama.\n</p>",
        "invited": false,
        "day": "20",
        "start": "1899-12-30T10:31:36.000Z",
        "end": "1899-12-30T11:01:36.000Z",
        "startlong": "September 20, 2022 09:30 GMT+10",
        "endlong": "September 20, 2022 10:00 GMT+10",
        "start_ISO8601": "2022-09-19T23:30:00.000Z",
        "end_ISO8601": "2022-09-20T00:00:00.000Z"
    },
    {
        "name": "Harshit Yadav",
        "affiliation": "Rice Univeristy",
        "title": "On non-counital Frobenius algebras",
        "abstract": "<p>\nOne characterization of Frobenius algebras is that they are finite-dimensional algebras \\(A\\) which come equipped with a coassociative, counital comultiplication map \\(\\Delta\\) that is an \\(A\\)-bimodule map. Here, we examine comultiplication maps for generalizations of Frobenius algebras: finite-dimensional self-injective (quasi-Frobenius) algebras. We show that large classes of such algebras, including finite-dimensional weak Hopf algebras, come equipped with a map \\(\\Delta\\) as above that is not necessarily counital. We also conjecture that this comultiplicative structure holds for self-injective algebras in general. This is joint work with Amanda Hernandez and Chelsea Walton.\n</p>",
        "invited": false,
        "day": "20",
        "start": "1899-12-30T11:01:36.000Z",
        "end": "1899-12-30T11:31:36.000Z",
        "startlong": "September 20, 2022 10:00 GMT+10",
        "endlong": "September 20, 2022 10:30 GMT+10",
        "start_ISO8601": "2022-09-20T00:00:00.000Z",
        "end_ISO8601": "2022-09-20T00:30:00.000Z"
    },
    {
        "name": "Christina Vasilakopolou",
        "affiliation": "National Technical University of Athens",
        "title": "Dual algebraic structures and enrichment",
        "abstract": "In this talk, we will provide a detailed overview of the sometimes called \"Sweedler theory\" for algebras and modules. This begins by establishing an enrichment of the category of algebras in the category of coalgebras, as well as an enrichment of a global category of modules in a global category of comodules, giving rise to a structure described as an enriched fibration. Moreover, by investigating a many-object generalization involving categories and modules, we will discuss further directions and applications of this framework to operadic structures.",
        "invited": true,
        "day": 20,
        "start": "1899-12-30T21:01:36.000Z",
        "end": "1899-12-30T22:01:36.000Z",
        "startlong": "September 20, 2022 20:00 GMT+10",
        "endlong": "September 20, 2022 21:00 GMT+10",
        "start_ISO8601": "2022-09-20T10:00:00.000Z",
        "end_ISO8601": "2022-09-20T11:00:00.000Z"
    },
    {
        "name": "Daniele Palombi",
        "affiliation": "Sapienza University of Rome",
        "title": "Classifying topoi in synthetic guarded domain theory: the universal property of multi-clock guarded recursion",
        "abstract": "<p>\nSeveral different topoi have played an important role in the development and applications of synthetic guarded domain theory (SGDT), a new kind of synthetic domain theory that abstracts the concept of guarded recursion frequently employed in the semantics of programming languages. In order to unify the accounts of guarded recursion and coinduction, several authors have enriched SGDT with multiple \"clocks\" parameterizing different time-streams, leading to more complex and difficult to understand topos models. Until now these topoi have been understood very concretely qua categories of presheaves, and the logico-geometrical question of what theories these topoi classify has remained open. We show that several important topos models of SGDT classify very simple geometric theories, and that the passage to various forms of multi-clock guarded recursion can be rephrased more compositionally in terms of the lower bagtopos construction of Vickers and variations thereon due to Johnstone. We contribute to the consolidation of SGDT by isolating the universal property of multi-clock guarded recursion as a modular construction that applies to any topos model of single-clock guarded recursion.\n</p>\n\n<p>j.w.w. Dr. Jonathan Sterling</p>",
        "invited": false,
        "day": "20",
        "start": "1899-12-30T22:31:36.000Z",
        "end": "1899-12-30T23:01:36.000Z",
        "startlong": "September 20, 2022 21:30 GMT+10",
        "endlong": "September 20, 2022 22:00 GMT+10",
        "start_ISO8601": "2022-09-20T11:30:00.000Z",
        "end_ISO8601": "2022-09-20T12:00:00.000Z"
    },
    {
        "name": "Konrad Martinek",
        "affiliation": "University of Vienna",
        "title": "Monoidal 2-supercategories and \\(\\Pi\\)-structures",
        "abstract": "<p>\n\\(\\mathbb{Z}/2\\mathbb{Z}\\)-gradings appear in diverse contexts, e.g. in physics in the study of supersymmetry which, at its core, studies supervector spaces, i.e. \\(\\mathbb{Z}/2\\mathbb{Z}\\)-graded vector spaces. Central to this is the \"Koszul sign rule\", a signed version of the middle interchange law of the tensor product. The tensor product with this sign rule, however, fails to be functorial, hence, does not yield a monoidal structure on the whole category of supervector spaces. This leads one the concept of (monoidal/2-)supercategories.\n</p>\n<p>\nFollowing a paper by J. Brundan and A. P. Ellis from 2017, I will introduce the concept of a supercategory, a monoidal supercategory, and a 2-supercategory. Then I will give a definition for a monoidal 2-supercategory and explicitly define such a monoidal structure on the 2-supercategory \\(\\mathrm{SAlg}_k\\) of superalgebras over the field \\(k\\), supermodules and morphisms of supermodules. Another motivating example for defining monoidal 2-supercategories is the 2-category of Landau-Ginzburg models. These examples also admit braided structures.\n<p>\n</p>\nJ. Brundan and A. P. Ellis prove a correspondence between (2-)supercategories and so-called \\(\\Pi\\)-(2-)categories, \\(k\\)-linear (2-)categories with a \\(\\mathbb{Z}/2\\mathbb{Z}\\)-action. Using this, the monoidal structure above reduces to the non-graded case, but with the additional datum of a \\(\\Pi\\)-structure, i.e. a \\(\\mathbb{Z}/2\\mathbb{Z}\\)-action.\n</p>\n<p>\nMotivated by this, I will present first steps towards a classification attempt of \\(\\Pi\\)-structures on a given \\(k\\)-linear category.\n</p>",
        "invited": false,
        "day": "20",
        "start": "1899-12-30T23:01:36.000Z",
        "end": "1899-12-30T23:31:36.000Z",
        "startlong": "September 20, 2022 22:00 GMT+10",
        "endlong": "September 20, 2022 22:30 GMT+10",
        "start_ISO8601": "2022-09-20T12:00:00.000Z",
        "end_ISO8601": "2022-09-20T12:30:00.000Z"
    },
    {
        "name": "Chris Hone",
        "affiliation": "University of Sydney",
        "title": "Commuting diagrams in the six functor formalism.",
        "abstract": "<p>\nIn sheaf theoretic geometry, we naturally obtain a large piece of two categorical data, a *-autonomous ategory for each geometric object, and four functors for every morphism of geometric objects. These satisfy a myriad of relations, and a natural question is to ask which diagrams built out of this data commute? In this direction, I will explain a weak \"all diagrams commute\" result, and some of the symmetric group combinatorics used to prove this result.\n</p>",
        "invited": false,
        "day": "21",
        "start": "1899-12-30T09:01:36.000Z",
        "end": "1899-12-30T09:31:36.000Z",
        "startlong": "September 21, 2022 08:00 GMT+10",
        "endlong": "September 21, 2022 08:30 GMT+10",
        "start_ISO8601": "2022-09-20T22:00:00.000Z",
        "end_ISO8601": "2022-09-20T22:30:00.000Z"
    },
    {
        "name": "Fabio Calderon",
        "affiliation": "National University of Colombia (Universidad Nacional de Colombia)",
        "title": "Representations of (weak) Hopf algebras from a categorical point of view",
        "abstract": "<p>\nThe action of a (weak) Hopf algebra \\(H\\) on an algebra \\(A\\) can be defined three-ways: (1) as \\(A\\) being an <i>monoid object</i> in the monoidal category of \\(H\\)-modules, (2) as \\(A\\) being an \\(H\\)-<i>module algebra</i>, and (3) as \\(A\\) being a <i>representation</i> of \\(H\\). In this talk,  using suitable pairs of adjoint functors, I will present the explicit equivalence between these three setups for certain classes of both classical and weak Hopf algebras.\n</p>",
        "invited": false,
        "day": "21",
        "start": "1899-12-30T09:31:36.000Z",
        "end": "1899-12-30T10:01:36.000Z",
        "startlong": "September 21, 2022 08:30 GMT+10",
        "endlong": "September 21, 2022 09:00 GMT+10",
        "start_ISO8601": "2022-09-20T22:30:00.000Z",
        "end_ISO8601": "2022-09-20T23:00:00.000Z"
    },
    {
        "name": "Josh Lalonde",
        "affiliation": "Independent",
        "title": "Dialectical Mathematics: Lawvere and Hegel",
        "abstract": "<p>In several of his papers, F. William Lawvere comments extensively on 19th-century German philosopher G. W. F. Hegel, and in other texts, he uses terminology that seems to be drawn from Hegel. This is somewhat surprising, as Hegel has relatively little to say about mathematics in general, and few mathematicians have shown any interest in his work. (Presumably as a result of Lawvere’s references to him, Hegel now has a page on the nLab.) In the historical literature on category theory, the influence of Hegel on Lawvere and thereby on the development of category theory has received little attention. I propose to present work in progress on this little-known strand of the history of category theory. I will quickly sketch some aspects of Hegel’s philosophical work that may have captured Lawvere’s interest, in particular his dialectical account of logic as the “becoming” of concepts. I will then examine some of Lawvere’s references and allusions to Hegel in his published writings. Finally, I will try to extract some suggestions from Lawvere’s use of Hegel as to what a dialectical approach to mathematics should look like.</p>",
        "invited": false,
        "day": "21",
        "start": "1899-12-30T10:31:36.000Z",
        "end": "1899-12-30T11:01:36.000Z",
        "startlong": "September 21, 2022 09:30 GMT+10",
        "endlong": "September 21, 2022 10:00 GMT+10",
        "start_ISO8601": "2022-09-20T23:30:00.000Z",
        "end_ISO8601": "2022-09-21T00:00:00.000Z"
    },
    {
        "name": "Amartya Dubey",
        "affiliation": "National Institute of Science Education and Research, India",
        "title": "Non presentable Infinity-topos semantics of Homotopy Type Theory",
        "abstract": "<p>\nThere have been some really exciting recent developments on \"Elementary higher topos\" semantics of  Homotopy Type Theory with Cherradi finally settling the problem of the existence of an elementary higher topos model of Homotopy type theory  . But we are interested in the generalization of Mike Shulman's result on interpretation of Homotopy type theory with strict univalent universes to non-presentable cases by the construction of a Type Theoretic \"Elementary\" Model Topos , which is work by Rasekh through the Filter Product construction. Most of my talk will be expository in nature based on work of Shulman and Rasekh. At the end I'll present work in progress towards a realizability model of Homotopy Type Theory.\n</p>",
        "invited": false,
        "day": "21",
        "start": "1899-12-30T21:01:36.000Z",
        "end": "1899-12-30T21:31:36.000Z",
        "startlong": "September 21, 2022 20:00 GMT+10",
        "endlong": "September 21, 2022 20:30 GMT+10",
        "start_ISO8601": "2022-09-21T10:00:00.000Z",
        "end_ISO8601": "2022-09-21T10:30:00.000Z"
    },
    {
        "name": "Nicolas Blanco",
        "affiliation": "University of Birmingham",
        "title": "Generalisations of multicategories and their string diagrams",
        "abstract": "<p>\nIn this talk I will give an overview of three directions in which multicategories have been extended together with their graphical representations, namely polycategories, fibred multicategories and virtual double categories.\n</p>\n<p>\nFirst, I will go over some multicategory theory, in particular the notions of tensor products and representable multicategories. I will explain how these can be introduced graphically as pairs of (pseudo)monoids and (pseudo)comonoids interacting together. I will show how the correspondence between representable multicategories and monoidal categories can be made explicit graphically.\n</p>\n<p>\nThen, I will introduce some generalisations of multicategories: by allowing for many outputs giving rise to <i>polycategories</i> and a correspondence with models of classical multiplicative linear logic (\\(\\ast\\)-autonomous categories); by performing an horizontal categorification with a <i>virtual double category</i> being seen as a many-object-many-vertical-arrow multicategory; by having tensor products being parametrised by a choice of multimap in some other multicategory yielding the notion of <i>pushforward</i> in a fibred multicategory. For all of these, I will explain how to extend the graphical representation. In the polycategorical case, I will show the connection with the proof nets of linear logic. For virtual double categories, I will recover some notions already used in the literature. While the one for fibred multicategories is new as far as I am aware.\n</p>\n<p>\nIf time permits, I will explore how to combine these generalisations and how the graphical calculus could help shed more light on these abstractions.\n</p>",
        "invited": false,
        "day": "21",
        "start": "1899-12-30T21:31:36.000Z",
        "end": "1899-12-30T22:01:36.000Z",
        "startlong": "September 21, 2022 20:30 GMT+10",
        "endlong": "September 21, 2022 21:00 GMT+10",
        "start_ISO8601": "2022-09-21T10:30:00.000Z",
        "end_ISO8601": "2022-09-21T11:00:00.000Z"
    },
    {
        "name": "Manuel Mancini",
        "affiliation": "University of Palermo",
        "title": "Weak Representability of Actions for categories of Leibniz algebras and Poisson algebras",
        "abstract": "<p>\nIt is well known that, in the semi-abelian category \\(\\mathbf{LieAlg}_{\\mathbb{F}}\\) of Lie algebras over a field \\( \\mathbb{F} \\) with \\(\\operatorname{char}(\\mathbb{F}) \\neq 2 \\), algebra actions are represented by derivations. From a categorical point of view, this means that the category \\( \\mathbf{LieAlg}_{\\mathbb{F}} \\) is <i>action representable</i> and the representing object, which is called the <i>actor</i>, is the Lie algebra of derivations. The notion of action representable category has proven to be quite restrictive. For example, if a variety \\( \\mathcal{V} \\) of non-associative algebras over \\( \\mathbb{F} \\) is action representable, then \\( \\mathcal{V} \\) must be the category \\( \\mathbf{LieAlg}_{\\mathbb{F}} \\). More recently G. Janelidze introduced the notion of <i>weakly action representable category</i>, which includes a wider class of categories. In this talk we explain that the category \\(\\mathbf{LeibAlg}_{\\mathbb{F}} \\) of (right) Leibniz algebras and the category \\( \\mathbf{Pois}_{\\mathbb{F}} \\) of (non-commutative) Poisson algebras are weakly action representable. In both cases we give we give construction of the weak actor \\([X]\\) of a fixed object \\(X\\) and, given two objects \\(X, B\\), we provide a complete description of the <i>acting morphisms</i> \\( B \\rightarrow [X] \\), i.e. of the morphisms which identify the split extensions of \\(B\\) by \\(X\\). This is joint work with Alan Cigoli (<i>University of Turin</i>) and Giuseppe Metere (<i>University of Palermo</i>).\n</p>",
        "invited": false,
        "day": "21",
        "start": "1899-12-30T22:31:36.000Z",
        "end": "1899-12-30T23:01:36.000Z",
        "startlong": "September 21, 2022 21:30 GMT+10",
        "endlong": "September 21, 2022 22:00 GMT+10",
        "start_ISO8601": "2022-09-21T11:30:00.000Z",
        "end_ISO8601": "2022-09-21T12:00:00.000Z"
    },
    {
        "name": "Jean-Baptiste Vienney",
        "affiliation": "University of Ottawa",
        "title": "Differential and bialgebraic characterizations of symmetric powers",
        "abstract": "<p>\nIn a \\(\\mathbb{Q}^{+}\\)-linear symmetric monoidal category, symmetric powers can be defined as a special kind of split idempotent. The \\(n^{th}\\) symmetric power of a R-module is the space of formal homogeneous polynomials of degree \\(n\\) in the vectors of the module. By using ideas from differential categories, we can equivalently describe jointly all the symmetric powers of an object by means of two families of morphisms which express differentiation and multiplication of homogenous polynomials and must verify the Leibniz rule as well as the Euler identity. Equivalently, it can be understood as bosonic annihilation and creation operators. A second characterization of all symmetric powers is in term of a special kind of graded bialgebra. We introduce the new concepts of graded differential category and special graded bialgebra on the road and explain that symmetric powers are also characterized as forming a special kind of codifferential category that we could name an homogeneous polynomial codifferential category.\n</p>",
        "invited": false,
        "day": "22",
        "start": "1899-12-30T09:01:36.000Z",
        "end": "1899-12-30T09:31:36.000Z",
        "startlong": "September 22, 2022 08:00 GMT+10",
        "endlong": "September 22, 2022 08:30 GMT+10",
        "start_ISO8601": "2022-09-21T22:00:00.000Z",
        "end_ISO8601": "2022-09-21T22:30:00.000Z"
    },
    {
        "name": "Adrian Miranda",
        "affiliation": "Macquarie University",
        "title": "Semi-strictness in Three Dimensional Category Theory",
        "abstract": "<p>\nIn two dimensions, every weak \\(2\\)-category (ie. bicategory) is weakly equivalent (ie biequivalent) to a strict \\(2\\)-category. \\(2\\)-categories are genuinely strict in that all the usual laws hold on the nose rather than up to any coherent higher dimensional cell. The analogous statement in dimension three is that any tricategory is triequivalent to one in which everything is strict except for the usual middle four interchange law for \\(2\\)-categories. Such three dimensional categories are called  \\(\\mathrm{Gray}\\)-categories, as they are enriched over a symmetric monoidal closed structure on \\(2\\)-\\(\\mathrm{Cat}\\) due to John Gray. The cells in the closed structure consist of \\(2\\)-functors, pseudonatural transformations and modifications. As I will explain these can be thought of as semi-strict maps between \\(2\\)-categories, although in dimension two semi-strict things are either fully strict or fully weak.\n<p>\nIn this talk I will describe a similar non-symmetric, non-monoidal closed structure on \\(\\operatorname{Gray-Cat}\\). The morphisms in the internal hom \\([A, B]\\) will be (composites of) certain <i>semi-strict trinatural transformations</i>, which I will introduce in the talk. Like \\(\\mathrm{Gray}\\)-categories, these are neither fully strict nor fully weak. Time permitting I will talk about enrichment over this structure.\n</p>",
        "invited": false,
        "day": "22",
        "start": "1899-12-30T09:31:36.000Z",
        "end": "1899-12-30T10:01:36.000Z",
        "startlong": "September 22, 2022 08:30 GMT+10",
        "endlong": "September 22, 2022 09:00 GMT+10",
        "start_ISO8601": "2022-09-21T22:30:00.000Z",
        "end_ISO8601": "2022-09-21T23:00:00.000Z"
    },
    {
        "name": "Giulian Wiggins",
        "affiliation": "University of Sydney",
        "title": "Stratifications of abelian categories",
        "abstract": "<p>\nA stratification of an abelian category is a way to decompose that abelian category into smaller categories. In this talk we explain and motivate the definition of a stratification of abelian category, and give examples of where these arise in nature. In addition, we present some original applications to representation theory.\n</p>",
        "invited": false,
        "day": "22",
        "start": "1899-12-30T10:31:36.000Z",
        "end": "1899-12-30T11:01:36.000Z",
        "startlong": "September 22, 2022 09:30 GMT+10",
        "endlong": "September 22, 2022 10:00 GMT+10",
        "start_ISO8601": "2022-09-21T23:30:00.000Z",
        "end_ISO8601": "2022-09-22T00:00:00.000Z"
    },
    {
        "name": "Marcy Robertson",
        "affiliation": "University of Melbourne",
        "title":"How to write (and perfect) your academic CV",
        "abstract":"I’ll go over some basics on what goes on your academic CV, give tips for doing an annual \"CV checkup\" and provide some ideas for how one goes about filling gaps in your CV. Bring your CV and your questions!",
        "invited": true,
        "day": 22,
        "start": "1899-12-30T11:01:36.000Z",
        "end": "1899-12-30T12:01:36.000Z",
        "startlong": "September 22, 2022 10:00 GMT+10",
        "endlong": "September 22, 2022 11:00 GMT+10",
        "start_ISO8601": "2022-09-22T00:00:00.000Z",
        "end_ISO8601": "2022-09-22T01:00:00.000Z"
    },
    {
        "name": "Guillaume Laplante-Anfossi",
        "affiliation": "University of Melbourne",
        "title": "Categorical coherence, polytopes and Koszul duality",
        "abstract": "<p>\nEven though MacLane’s coherence theorem for symmetric monoidal categories, one of the fundamental results in category theory, was written in the language of rewriting theory, it bears a very homotopical flavour. Kapranov suggested in 1993 an \"instant proof’\" of this theorem, using the geometry that underlies parenthesizations of words. Building on this insight, we present a general polytopal coherence theorem, showing that in the presence of polytopes, techniques from discrete geometry can be used to prove coherence in a very visual and concise manner. When applied to operadic families of polytopes encoding algebraic structures up to homotopy, this theorem provides, beside coherence proofs for the associated categorified notions, a new proof that the associated operads are Koszul, and even Koszul self-dual. This is joint work with Pierre-Louis Curien.\n</p>",
        "invited": false,
        "day": "22",
        "start": "1899-12-30T21:01:36.000Z",
        "end": "1899-12-30T21:31:36.000Z",
        "startlong": "September 22, 2022 20:00 GMT+10",
        "endlong": "September 22, 2022 20:30 GMT+10",
        "start_ISO8601": "2022-09-22T10:00:00.000Z",
        "end_ISO8601": "2022-09-22T10:30:00.000Z"
    },
    {
        "name": "Jaco Ruit",
        "affiliation": "Utrecht University",
        "title": "Higher proarrow equipments",
        "abstract": "<p>Classically, 2-categories may be equipped with so-called proarrow equipments. These equipments are precisely those double categories so that each vertical arrow admits a companion and conjoint. When a 2-category is endowed with such a structure, one may do formal category theory in the 2-category. In this talk, we will discuss a generalization of equipments to the \\(\\infty\\)-categorical world. These \\(\\infty\\)-equipments will again yield a formal category theory in their associated \\((\\infty,2)\\)-categories. We will see some examples and basic closure properties of these \\(\\infty\\)-equipments, and also briefly discuss the free companion and free conjoint if time permits. Furthermore, we hope to touch on a motivation for studying these \\(\\infty\\)-equipments: namely, they can be used to construct equivariant and parametrized \\(\\infty\\)-category theory.</p>",
        "invited": false,
        "day": "22",
        "start": "1899-12-30T21:31:36.000Z",
        "end": "1899-12-30T22:01:36.000Z",
        "startlong": "September 22, 2022 20:30 GMT+10",
        "endlong": "September 22, 2022 21:00 GMT+10",
        "start_ISO8601": "2022-09-22T10:30:00.000Z",
        "end_ISO8601": "2022-09-22T11:00:00.000Z"
    },
    {
        "name": "Ruben Van Belle",
        "affiliation": "University of Edinburgh",
        "title": "A categorical proof of the Carathéodory extension theorem",
        "abstract": "<p>The Carathéodory extensions theorem is a fundamental result in measure theory as it is\nneeded for the existence of measures we want to work with. A problem that often occurs\nin measure theory is that we don’t know what a general measurable subset looks like.\nThe Carathéodory extension theorem says that to define a measure we don’t have to say\nsomething about every measurable subset, but only a generating Boolean algebra.</p>\n<p>To prove this result categorically, we represent (pre)measures and outer measures by\ncertain co/lax and strict transformations. The carathéodory extension then corresponds to\na Kan extension of strict transformations. We develop a general framework for extensions\nof transformations between poset-valued functors and give several results on the existence\nand construction of extensions of these transformations. We proceed by showing that transformations and functors corresponding to measures satisfy these results, which proves the Carathéodory extension theorem.</p>",
        "invited": false,
        "day": "22",
        "start": "1899-12-30T23:01:36.000Z",
        "end": "1899-12-30T23:31:36.000Z",
        "startlong": "September 22, 2022 22:00 GMT+10",
        "endlong": "September 22, 2022 22:30 GMT+10",
        "start_ISO8601": "2022-09-22T12:00:00.000Z",
        "end_ISO8601": "2022-09-22T12:30:00.000Z"
    },
    {
        "name": "Guglielmo Nocera",
        "affiliation": "Université Paris 13",
        "title": "The Exodromy Theorem",
        "abstract": "<p>Let \\(X\\) be a connected topological space. By a classical theorem in algebraic topology, the category of locally constant sheaves on \\(X\\) with values in Set is equivalent to the category of representations of \\(\\pi_1(X)\\). In particular, our category is of the form \\(\\operatorname{Fun}(\\mathcal{A}(X),\\mathcal{B})\\), where \\(\\mathcal{B}\\) is a category which does not depend on \\(X\\) and is presentable. This presentation has interesting abstract categorical consequences (for example, the category of locally constant sheaves is itself presentable). This kind of presentation can be extended to other categories of sheaves, e.g. the category of constructible sheaves on a stratified space. This latter statement is due to Robert Macpherson and has been generalized to the setting of derived categories by Jacob Lurie. We explain the statement of the theorem and mention an application to our research.</p><p><b>Prerequisites:</b> Basic algebraic topology (homotopy groups), basic category theory (presentable categories, symmetric monoidal categories). Lurie’s theorem will only be mentioned briefly at the end, and will be accessible to those with basic knowledge in higher category theory and homological algebra.</p>",
        "invited": false,
        "start_ISO8601": "2022-09-22T22:00:00.000Z",
        "end_ISO8601": "2022-09-22T22:30:00.000Z"
    },
    {
        "name": "Samarpita Ray",
        "affiliation": "IBS Center for Geometry and Physics",
        "title": "Cohomology of modules over H-categories and co-H-categories",
        "abstract": "<p>Introduced by Cibils and Solotar, \\(H\\)-categories and co-\\(H\\)-categories generalise \\(H\\)-module algebras and \\(H\\)-comodule algebras respectively, for a Hopf algebra \\(H\\). In this talk, I will discuss the cohomology theory of these module categories by constructing several Grothendieck spectral sequences. In particular, we will consider \\(H\\)-equivariant modules over an \\(H\\)-category \\(\\mathcal{C}\\) as modules over the smash extension \\(\\mathcal{C}\\#H\\) and discuss Grothendieck spectral sequences for the cohomologies as well as the \\(H\\)-locally finite cohomologies of these objects. We will also introduce relative Hopf modules over a co-\\(H\\)-category and discuss Grothendieck spectral sequences for their cohomologies by using their rational Hom objects and higher derived functors of coinvariants.</p>",
        "invited": false,
        "start_ISO8601": "2022-09-22T22:30:00.000Z",
        "end_ISO8601": "2022-09-22T23:00:00.000Z"
    },
    {
        "name": "Kurt Stoeckl",
        "affiliation": "University of Melbourne",
        "title": "A Koszul Operad for Wheeled Props",
        "abstract": "<p>\nA prop is a free symmetric monoidal category generated by a single object, meaning that any morphism in a prop is of the form \\(x^{\\otimes m}\\rightarrow x^{\\otimes n}\\). A wheeled prop is a prop in which every object has a dual. Props and wheeled props arise naturally in the study of homotopy coherent algebraic structures, deformation theory and knot theory. It is well known that there exist discrete coloured operads (multicategories) which govern props and wheeled props. This arises from the underlying fact that trees can be used to form disconnected graphs possibly with directed cycles. In this talk we'll discuss a groupoid coloured operad governing wheeled props, and prove that this operad is Koszul. One consequence of our construction is that we can give a definition of an infinity wheeled prop, which is to wheeled props as infinity categories are to categories.\n</p>",
        "invited": false,
        "day": "23",
        "start": "1899-12-30T10:31:36.000Z",
        "end": "1899-12-30T11:01:36.000Z",
        "startlong": "September 23, 2022 09:30 GMT+10",
        "endlong": "September 23, 2022 10:00 GMT+10",
        "start_ISO8601": "2022-09-22T23:30:00.000Z",
        "end_ISO8601": "2022-09-23T00:00:00.000Z"
    },
    {
        "name": "Matt Alexander",
        "affiliation": "University of Regina",
        "title": "An Operad of Operad Algebras",
        "abstract": "<p>\nOperads are mathematical objects which are meant to abstractly capture the notion of operations in an algebraic structure. The process of 'taking an algebra over an operad' creates from these abstract operations, something concrete. For example, algebras over the associative operad are monoids.\n</p>\n\n<p>\nGiven a small category, \\(C\\), and an operad, \\(P\\), we can construct a new operad, \\(P^C\\), whose algebras are \\(C\\)-shaped diagrams of \\(P\\)-algebras. In this talk we will present a construction of the operad \\(P^C\\) and discuss its relevance in the context of quantum field theory.\n</p>",
        "invited": false,
        "day": "23",
        "start": "1899-12-30T11:01:36.000Z",
        "end": "1899-12-30T11:31:36.000Z",
        "startlong": "September 23, 2022 10:00 GMT+10",
        "endlong": "September 23, 2022 10:30 GMT+10",
        "start_ISO8601": "2022-09-23T00:00:00.000Z",
        "end_ISO8601": "2022-09-23T00:30:00.000Z"
    },
    {
        "name": "Dirk Hofmann",
        "affiliation": "Universidade de Aveiro",
        "title": "Topology through the eyes of enriched categories",
        "abstract" : "Employing a formal analogy between order sets (respectively categories) and topological (and other kinds of) spaces, over the past decades we have investigated the meaning of various categorical constructions in topology. Within this setting, our study of spaces is primary based on concepts and results like distributor, colimit, adjunction, dual space and the Yoneda lemma; however, we stress that this path leads us naturally to more traditional topics such as compact, locally compact and stably compact spaces, to the filter space and the Vietories construction, and to sober spaces and continuous lattices. In particular, we explain the relation ship between soberness and Cauchy completeness, the presheaf monads and the filter respectively Vietoris space, cocomplete categories and continuous lattice, distributivity and disconnectedness, and how the statement \"\\(X\\) is totally cocomplete iff \\(X^\\mathrm{op}\\) is totally complete\" specialises to O. Wylers characterisation of the algebras of the Vietoris monad on compact Hausdorff spaces.",
        "invited": true,
        "start_ISO8601": "2022-09-23T10:00:00.000Z",
        "end_ISO8601": "2022-09-23T11:00:00.000Z"
    },
    {
        "name": "Diana Kessler",
        "affiliation": "Tallinn University of Technology",
        "title": "Data structures for topologically sound higher-dimensional diagram rewriting",
        "abstract": "<p>\nThis is joint work with Amar Hadzihasanovic.\n</p>\n\n<p>\nIn this work, we are concerned with the computational implementation of diagrammatic sets, a model of higher-dimensional diagram rewriting. Our model is based on an interpretation of rewrite systems as directed cell complexes and has the advantage of being topologically sound – there is a functorial interpretation of rewrite systems as cell complexes and of rewrites as homotopies. Amongst the applications of diagram rewriting are the formalisation of higher category theory, higher algebra and combinatorial topology. But we are also interested in diagram rewriting as a model of computation in itself – i.e. computations on \\(n\\)-dimensional data happen at dimension \\((n+1)\\). \n</p>\n\n<p>\nIn diagrammatic sets, we encode the shape of a diagram via its face poset together with orientation data. In this talk, we will present the data structures and algorithms used to implement well-formed shapes of diagrams. An important result is a polynomial-time algorithm for solving the isomorphism problem between two well-formed shapes of diagrams – the isomorphism problem extended to all shapes of diagrams is not known to be in P. Then, we will introduce a type theory for diagrammatic sets which is build on top of the implementation mentioned above. The diagrams and diagrammatic sets are implemented through this type theory. What we will present is already part of a Python library called <a href='https://rewalt.readthedocs.io/en/latest/'>rewalt</a>. \n</p>",
        "invited": false,
        "day": "23",
        "start": "1899-12-30T22:31:36.000Z",
        "end": "1899-12-30T23:01:36.000Z",
        "startlong": "September 23, 2022 21:30 GMT+10",
        "endlong": "September 23, 2022 22:00 GMT+10",
        "start_ISO8601": "2022-09-23T11:30:00.000Z",
        "end_ISO8601": "2022-09-23T12:00:00.000Z"
    },
    {
        "name": "Joshua Wrigley",
        "affiliation": "Università degli Studi dell'Insubria",
        "title": "The Geometric Completion of a Doctrine",
        "abstract": "<p>\nAt the previous Categories and Companions Symposium, I sketched how classifying toposes can be thought of as the first-order analogue of Lindenbaum-Tarski algebras for propositional theories.  In this presentation, that analogy is made precise through the use of doctrines.\n</p>\n<p>\nDoctrines are a natural setting for the categorical study of theories of first order logic.  Recently, many completions of doctrines to richer syntax have been studied in the literature.  We introduce the geometric completion of a doctrine, which represents the universal addition of the syntax of geometric logic to a doctrine.  We will demonstrate the universal property of the geometric completion as well as the relationship between the geometric completion, internal locales, and classifying toposes.\n</p>",
        "invited": false,
        "day": "23",
        "start": "1899-12-30T23:01:36.000Z",
        "end": "1899-12-30T23:31:36.000Z",
        "startlong": "September 23, 2022 22:00 GMT+10",
        "endlong": "September 23, 2022 22:30 GMT+10",
        "start_ISO8601": "2022-09-23T12:00:00.000Z",
        "end_ISO8601": "2022-09-23T12:30:00.000Z"
    },
    {
        "name": "Ralph Sarkis",
        "affiliation": "ENS de Lyon",
        "title": "Beyond Nonexpansive Operations in Quantitative Algebraic Reasoning",
        "abstract": "<p>Quantitative equational logic is a tool recently developed to reason about program distances when the computational effects are algebraic. After covering the seminal definitions and results of quantitative algebraic reasoning, I will present our recent extension that allows unconstrained operations on metric spaces and my attempt to paint the categorical picture behind it. Based on <a href='https://arxiv.org/abs/2201.09087'>joint work with Matteo Mio and Valeria Vignudelli</a></p>\n\n<p> <b>Riddle:</b> At the start of the talk, I will give an answer to the following riddle. Given a possibly unfair coin that you know can fall on either side (i.e. an infinite sequence of i.i.d Bernoulli(p) random variables where p is unknown but neither 0 nor 1), how can you simulate a fair coin using no other source of randomness?</p>",
        "invited": false
    },
    {
        "name": "Samarpita Ray",
        "affiliation": "IBS Center for Geometry and Physics, POSTECH, South Korea",
        "title": "Cohomology of modules over H-categories and co-H-categories",
        "abstract": "<p>\nIntroduced by Cibils and Solotar, \\(H\\)-categories and co-\\(H\\)-categories generalise \\(H\\)-module algebras and \\(H\\)-comodule algebras respectively, for a Hopf algebra \\(H\\). In this talk, I will discuss the cohomology theory of these module categories by constructing several Grothendieck spectral sequences. In particular, we will consider \\(H\\)-equivariant modules over an \\(H\\)-category \\(\\mathcal{C}\\) as modules over the smash extension \\(\\mathcal{C}\\#H\\) and discuss Grothendieck spectral sequences for the cohomologies as well as the \\(H\\)-locally finite cohomologies of these objects. We will also introduce relative Hopf modules over a co-\\(H\\)-category and discuss Grothendieck spectral sequences for their cohomologies by using their rational Hom objects and higher derived functors of coinvariants.\n </p>",
        "invited": false
    }
]